#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
** Step 7 Part 4: check your DNS
- Test


#+BEGIN_SRC sh :results verbatim
dig @172.29.199.12 torbit-class.shanse1.glb-qa.torbit.walmart.net
#+END_SRC

#+RESULTS:
#+begin_example

; <<>> DiG 9.10.3-P4-Ubuntu <<>> @172.29.199.12 torbit-class.shanse1.glb-qa.torbit.walmart.net
; (1 server found)
;; global options: +cmd
;; Got answer:
;; ->>HEADER<<- opcode: QUERY, status: NOERROR, id: 37372
;; flags: qr rd ra; QUERY: 1, ANSWER: 3, AUTHORITY: 0, ADDITIONAL: 1

;; OPT PSEUDOSECTION:
; EDNS: version: 0, flags:; udp: 4096
;; QUESTION SECTION:
;torbit-class.shanse1.glb-qa.torbit.walmart.net.	IN A

;; ANSWER SECTION:
torbit-class.shanse1.glb-qa.torbit.walmart.net.	1 IN A 10.65.42.198
torbit-class.shanse1.glb-qa.torbit.walmart.net.	1 IN A 10.65.42.197
torbit-class.shanse1.glb-qa.torbit.walmart.net.	1 IN A 10.65.42.199

;; Query time: 1533 msec
;; SERVER: 172.29.199.12#53(172.29.199.12)
;; WHEN: Mon Oct 22 09:10:49 UTC 2018
;; MSG SIZE  rcvd: 123

#+end_example

